Revit 2027 API
StructuralConnectionHandler.IsCustom Method
 Checks if Structural Connection Handler has the custom connection style.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCustom()
Public Function IsCustom As Boolean
public:
bool IsCustom()
member IsCustom : unit -> bool
Return Value
Boolean
 True if Structural Connection Handler has the custom connection style.
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace